[
  {
    "role": "BIM Software Developer",
    "modality": "Remote",
    "company": "APOGEA Consulting",
    "location": "Malaga, Spain",
    "startDate": "Jan 2024",
    "endDate": "Aug 2024",
    "experiences": [
      "Enhanced existing BIM applications by identifying and fixing bugs, which led to a 20% increase in user satisfaction and improved software stability.",
      "Developed BIM applications from the ground up, leveraging Vue.js and Tailwind CSS to deliver intuitive, high-performance interfaces.",
      "Collaborated with a team led by Antonio Gonzales to design and implement new tools for That Open Engine, contributing to innovative solutions for BIM workflows.",
      "Integrated techniques and best practices learned during the BIM Software Developer Master's program, continuously advancing product quality and functionality.",
      "Actively communicated and collaborated in a remote environment, participating in team meetings to share insights, address challenges, and streamline development processes."
    ],
    "skills": ["Tailwind", "That Open Engine", "TypeScript", "Vue", "HTML"]
  },
  {
    "role": "Construction Specialist",
    "modality": "Remote",
    "company": "Amherst - MainStreet Renewal",
    "location": "Houston, USA",
    "startDate": "Feb 2022",
    "endDate": "Sep 2022",
    "experiences": [
      "Managed vendor contracts for the Dallas, Nashville, and Salt Lake City markets, ensuring seamless operations and on-time project delivery for over 10 projects weekly.",
      "Optimized project budgets and renegotiated contracts with 40+ vendors, resulting in cost savings and more efficient project workflows.",
      "Resolved escalated construction management issues swiftly, maintaining project continuity and client satisfaction under tight deadlines.",
      "Demonstrated adaptability and multitasking skills in a high-pressure environment, balancing multiple responsibilities to meet project goals."
    ],
    "skills": ["Revit", "IFC"]
  },
  {
    "role": "Civil Project Engineer",
    "modality": "On-Site",
    "company": "CasaMax Inmobiliaria",
    "location": "San Jose, Costa Rica",
    "startDate": "Apr 2021",
    "endDate": "Jan 2022",
    "experiences": [
      "Led the construction, final inspection, and handover of multiple condominium projects, achieving on-time delivery and high client satisfaction.",
      "Conducted comprehensive quality inspections for various structures, ensuring compliance with standards for rainwater, sanitation, and drinking water management.",
      "Managed 10+ contracts per week, closely tracking project progress and addressing delays promptly to keep projects on schedule.",
      "Enhanced project quality and efficiency through effective personnel management, quality control, and customer service practices.",
      "Resolved conflicts proactively, fostering a collaborative work environment and driving project success."
    ],
    "skills": ["AutoCAD", "Microsoft Project"]
  }
]
